src/main/resources/atscale-small/0023-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="58EC67E6-8668-4A29-BA07-491F8C4E2B18"/>
  </soap:Header>
  <soap:Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>MDSCHEMA_PROPERTIES</RequestType>
      <Restrictions>
        <RestrictionList>
          <CUBE_NAME>AS Adventure Micro</CUBE_NAME>
          <HIERARCHY_UNIQUE_NAME>[Order Date].[MonthHierarchy]</HIERARCHY_UNIQUE_NAME>
          <PROPERTY_TYPE>1</PROPERTY_TYPE>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList>
          <Catalog>ASAdventureMicro</Catalog>
          <SafetyOptions>2</SafetyOptions>
          <MdxMissingMemberMode>Error</MdxMissingMemberMode>
          <DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse>
          <DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID>
          <DbpropMsmdRequestID>19806552-5C5F-41A5-B1BE-B06941CFB94A</DbpropMsmdRequestID>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility>
          <DbpropMsmdSubqueries>2</DbpropMsmdSubqueries>
        </PropertyList>
      </Properties>
    </Discover>
  </soap:Body>
</soap:Envelope>